clc
clear all;

%%V-REP XYZ欧拉角
% %'XYZ欧拉角矩阵'
R = myfun(0/180*pi,30/180*pi,30/180*pi)

%欧拉转四元数
w = 1/2*sqrt(1+R(1,1)+R(2,2)+R(3,3));
z = (R(2,1)-R(1,2))/(4*w);
y = (R(1,3)-R(3,1))/(4*w);
x = (R(3,2)-R(2,3))/(4*w);
q = [x y z w]


%v-rep里面的‘XYZ’刚好是‘ZYX’的rpy角度
tr2rpy(R)/pi*180

%%
%     Rotate = [0.41317582130432, -0.49240377545357, 0.76604455709457, -0.034000024199486; 0.76604449748993, 0.64278757572174, 2.9802322387695e-08, 0.27200004458427; -0.49240392446518, 0.58682417869568, 0.64278745651245, 0.22100003063679]
%     alpha = atan2(Rotate(3,2),Rotate(3,3))/pi*180
%     beta = atan2(-Rotate(3,1),sqrt(Rotate(3,3)^2+Rotate(3,2)^2))/pi*180
%     gamma = atan2(Rotate(2,1),Rotate(1,1))/pi*180